Repository: KDE/kapptemplate
Catalog: po/*/kapptemplate.po
Languages: ar, eo, sv

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Axel Rousseau,Oliver Kellogg
sv: Stefan Asserhäll

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: axel@esperanto-jeunes.org,olivermkellogg@gmail.com
sv: stefan.asserhall@gmail.com

# @title:column
source: Templates Projects
ar: مشاريع القوالب
eo: Ŝablonoj Projektoj
sv: Mallprojekt

# @title
source: Choose Template
ar: اختر قالباً
sv: Välj mall

# @action:intoolbar
source: Install Template From File
ar: ثبِّت القالب من ملف
sv: Installera mall från fil

# file dialog name filter
source: Archive Files (*.tar.bz2 *.zip)
ar: ملفات الأرشيف (*.tar.bz2 *.zip)
sv: Arkivfiler (*.tar.bz2 *.zip)

# @title
source: No Template Selected
ar: لا قالب محدد
sv: Ingen mall vald

# @action:button Go to the previous page
source: Previous
ar: السابق
sv: Föregående

# @action:button Go to the next page
source: Next
ar: التالي
sv: Nästa

# @title
source: Configure
ar: اضبط
sv: Anpassa

# @title:group
source: General
ar: عام
sv: Allmänt

# @label:textbox
source: Name:
ar: الاسم:
sv: Namn:

# @label:textbox
source: Location:
ar: الموقع:
sv: Plats:

# @info:placeholder
source: No folder selected
ar: لا مجلد محدد
sv: Ingen katalog vald

# @title:group
source: Metadata
ar: البيانات الوصفية

# @label:textbox
source: Version:
ar: الإصدار:

# @label:textbox
source: Author name:
ar: اسم المؤلف:
sv: Upphovsmannens namn:

# @label:textbox
source: Author email:
ar: بريد المؤلف الإلكتروني:
sv: Upphovsmannens e-postadress:

# @action:button Generate the application
source: Generate
ar: ولِّد
sv: Generera

source: %1 cannot be created.
ar: لا أستطيع إنشاء %1.
eo: %1 ne povas esti kreita.
sv: %1 kan inte skapas.

source: Path %1 could not be created.
ar: لا أستطيع إنشاء المسار %1.
eo: Vojo %1 ne povis esti kreita.
sv: Sökvägen %1 kan inte skapas.

source: Could not copy template file to %1, because the file is already exists. The project has not been generated and all temporary files will be removed.
ar: لا أستطيع نسخ ملف القالب إلى %1، لأن الملف موجود بالفعل. لم يجري توليد المشروع و ستُزال جميع الملفات المؤقتة.

source: Failed to integrate your project information into the file %1. The project has not been generated and all temporary files will be removed.
ar: فشل دمج معلومات مشروعك في الملف %1. لم يجري توليد المشروع و ستُزال جميع الملفات المؤقتة.
eo: Malsukcesis integri viajn projektajn informojn en la dosieron %1. La projekto ne estis kreita kaj ĉiuj provizoraj dosieroj estos forigitaj.
sv: Misslyckades integrera din projektinformation i filen %1. Projektet har inte skapats och alla tillfälliga filer kommer att tas bort.

source: Could not copy template file to %1.
ar: لا أستطيع نسخ ملف القالب إلى %1.
eo: Ne eblis kopii ŝablondosieron al %1.
sv: Kunde inte kopiera mallfil till %1

source: Could not load template archive for %1.
ar: لا أستطيع تحميل أرشيف القالب لـ %1.

source: Your project name is: <b>%1</b>, based on the <b>%2</b> template.<br />
ar: اسم مشروعك هو: <b>%1</b>، مستنداً على القالب <b>%2</b>.<br />
sv: Projektnamnet är: <b>%1</b>, baserat på mallen <b>%2</b>.<br />

source: Version: %1 <br /><br />
ar: الإصدار: %1 <br /><br />
eo: Versio: %1 <br /><br />

source: Installed in: %1 <br /><br />
ar: ثُبِّت في: %1 <br /><br />
eo: Instalita en: %1 <br /><br />
sv: Installeras i: %1 <br /><br />

source: You will find a README in your project folder <b>%1</b><br /> to help you get started with your project.
ar: ستجد ملف README في مجلد مشروعك <b>%1</b><br /> ليساعدك على البدء بمشروعك.
eo: Vi trovos README en via projekta dosierujo <b>%1</b><br /> por helpi vin komenci vian projekton.
sv: Du hittar filen README i projektkatalogen <b>%1</b><br /> för att hjälpa dig komma igång med ditt projekt.

# @title
source: Project Generation
ar: توليد المشروع
sv: Projektgenerering

# @action:button Close the application
source: Close
ar: أغلِق
sv: Stäng

# @title
source: Introduction
ar: مقدمة
sv: Inledning

source: This wizard will help you generate a new project to get started with Qt and KDE development.
ar: سيساعدك هذا المعالج على توليد مشروع جديد لتبدأ بتطوير Qt و KDE.
sv: Den här guiden hjälper dig att skapa ett nytt projekt för att komma igång med Qt- och KDE-utveckling.

source: Name of the project
ar: اسم المشروع
eo: Nomo de la projekto
sv: Projektets namn

source: Project version
ar: إصدار المشروع
eo: Projekta versio
sv: Projektversion

source: Home dir of the user
ar: دليل المستخدم الرئيسي
eo: Hejma dosierujo de la uzanto
sv: Användarens hemkatalog

source: Name of the user
ar: اسم المستخدم
eo: Nomo de la uzanto
sv: Användarens namn

source: Email of the user
ar: بريد المستخدم الإلكتروني
eo: Retpoŝto de la uzanto
sv: Användarens e-postadress

source: KAppTemplate is a KDE project template generator
ar: KAppTemplate هو مولّد قوالب مشاريع KDE
eo: KAppTemplate estas KDE-projekta ŝablongeneratoro
sv: Kapptemplate är en mallgenerator för KDE-projekt

source: (C) 2008 Anne-Marie Mahfouf
ar: (C) 2008 آن-ماري محفوف
sv: © 2008 Anne-Marie Mahfouf

source: Anne-Marie Mahfouf
ar: آن-ماري محفوف

source: Sean Wilson
ar: شون ويلسون

source: Icons from Oxygen Team icons
ar: أيقونات من أيقونات فريق Oxygen
eo: Piktogramoj el Oxygen-Teamaj piktogramoj
sv: Ikoner från Oxygen-gruppens ikoner

source: A Simple Application written with KDE Frameworks
ar: تطبيق بسيط مكتوب بإطارات عمل KDE
sv: Ett enkelt program skrivet med KDE Ramverk

source: Copyright %{CURRENT_YEAR}, %{AUTHOR} <%{EMAIL}>
ar: حقوق النسخ %{CURRENT_YEAR}، %{AUTHOR} <%{EMAIL}>

source: Author
ar: المؤلف
sv: Upphovsman

source: This project is %1 days old
ar: هذا المشروع عمره %1 يوماً
sv: Projektet är %1 dagar gammalt

# @action
source: Switch Colors
ar: بدّل الألوان
sv: Byt färger

# @title:tab
source: General
ar: عام
sv: Allmänt

source: Get More Templates
eo: Akiri Pli da Ŝablonoj

source: Install Template From File
eo: Instali Ŝablonon El Dosiero

source: Project name:
eo: Nomo de projekto:

source: Choose your project template
eo: Elektu vian projektan ŝablonon

source: No sample picture available.
eo: Neniu specimena bildo havebla.

source: Template description
eo: Ŝablona priskribo

source: Generating your project
eo: Generante vian projekton

source: Generation Progress
eo: Generacia Progreso

source: Succeeded.
eo: Sukcesis.

source: Your project name is: <b>%1</b>, based on the %2 template.<br />
eo: Via projektnomo estas: <b>%1</b>, bazita sur la ŝablono %2.<br />

# @title:window
source: Error
eo: Eraro

source: This wizard will help you generate a new project. You will be able to start developing your own software using Qt and KDE technologies from this template.
eo: Ĉi tiu asistanto helpos vin generi novan projekton. Vi povos komenci evoluigi vian propran programaron uzante teknologiojn Qt kaj KDE de ĉi tiu ŝablono.

# @title:window
source: KDE and Qt Template Generator
eo: KDE kaj Qt Ŝablona Generatoro

# @title:tab
source: Introduction
eo: Enkonduko

source: Set the project properties
eo: Agordi la projektajn proprecojn

# @action:button
source: Generate
eo: Generi

source: Your project name is: %1
eo: Via projektonomo estas: %1

source: &Version number:
eo: &Versionumero:

source: Project's version number
eo: Versionumero de la projekto

source: Set your project version number. A first project should start with version 0.1.
eo: Agordu vian projektan versionumeron. Unua projekto devus komenciĝi per versio 0.1.

source: In&stallation directory:
eo: Do&sierujo de instalo:

source: The directory where you will build your project
eo: La dosierujo kie vi konstruos vian projekton

source: Choose the directory where you will build your project. Your home /src is a good default location.
eo: Elektu la dosierujon, kie vi konstruos vian projekton. Via hejmo /src estas bona defaŭlta loko.

source: Author &name:
eo: Aŭtora &nomo:

source: Your first name and name
eo: Via antaŭnomo kaj nomo

source: This will set the copyright to this name
eo: Ĉi tio agordos la kopirajton al ĉi tiu nomo

source: A&uthor email:
eo: Retpoŝto de aŭt&oro:

source: Your email address
eo: Via retpoŝta adreso

source: This email address will be next to your name in the copyright credit of the project files.
eo: Ĉi tiu retadreso estos apud via nomo en la kopirajta kredito de la projektdosieroj.
